# **Exercício Bancos de Dados**

Criando banco de dados SQLite

In [1]:
%load_ext sql

In [2]:
%%sql
sqlite:///banco2.db

In [3]:
import sqlite3
import pandas as pd

!apt-get install sqlite3

In [4]:
conn = sqlite3.connect('/content/banco2.db')
cursor = conn.cursor()

 **1.**Crie uma tabela chamada "alunos" com os seguintes campos: id
(inteiro), nome (texto), idade (inteiro) e curso (texto).

In [5]:
cursor.execute('CREATE TABLE IF NOT EXISTS alunos (id INT, nome VARCHAR(100), idade INT, curso VARCHAR(50))')

2. Insira pelo menos 5 registros de alunos na tabela que você criou no
exercício anterior.

In [6]:
cursor.execute('''INSERT INTO alunos (id,nome,idade,curso) VALUES
(1,"Mônica",35,"Ciências Biológicas"),
(2,"Ricardo",20,"Administração"),
(3,"Larissa",27,"Engenharia"),
(4,"Letícia",39,"Engenharia"),
(5,"Pedro",23,"Ciências Biológicas"),
(6,"Leonardo",30,"Odontologia"),
(7,"Andréia",21,"Engenharia"),
(8,"João",45,"Análise e Desenvolvimento de Sistemas"),
(9,"Fabrício",27,"Ciência da Computação"),
(10,"Matheus",32,"Engenharia")''')

3. Consultas Básicas
Escreva consultas SQL para realizar as seguintes tarefas:

a) Selecionar todos os registros da tabela "alunos".

In [7]:
dados=cursor.execute('SELECT * FROM alunos')
for aluno in dados:
  print(aluno)

(1, 'Mônica', 35, 'Ciências Biológicas')
(2, 'Ricardo', 20, 'Administração')
(3, 'Larissa', 27, 'Engenharia')
(4, 'Letícia', 39, 'Engenharia')
(5, 'Pedro', 23, 'Ciências Biológicas')
(6, 'Leonardo', 30, 'Odontologia')
(7, 'Andréia', 21, 'Engenharia')
(8, 'João', 45, 'Análise e Desenvolvimento de Sistemas')
(9, 'Fabrício', 27, 'Ciência da Computação')
(10, 'Matheus', 32, 'Engenharia')

b) Selecionar o nome e a idade dos alunos com mais de 20 anos.

In [8]:
maior_20=cursor.execute('SELECT nome,idade FROM alunos WHERE idade>20')
for aluno in maior_20:
  print(aluno)

('Mônica', 35)
('Larissa', 27)
('Letícia', 39)
('Pedro', 23)
('Leonardo', 30)
('Andréia', 21)
('João', 45)
('Fabrício', 27)
('Matheus', 32)

c) Selecionar os alunos do curso de "Engenharia" em ordem
alfabética.

In [9]:
dados2=cursor.execute('SELECT nome FROM alunos WHERE curso="Engenharia" ORDER BY nome')
for aluno in dados2:
  print(aluno)

('Andréia',)
('Larissa',)
('Letícia',)
('Matheus',)

d) Contar o número total de alunos na tabela

In [10]:
quantidade=cursor.execute('SELECT COUNT(id) FROM alunos')
for quant in quantidade:
  print(quant[0])

10

4. Atualização e Remoção

In [11]:
cursor.execute('UPDATE alunos SET idade=28 WHERE nome="Pedro"')
idade_nova=cursor.execute('SELECT * FROM alunos')
for idade in idade_nova:
  print(idade)

(1, 'Mônica', 35, 'Ciências Biológicas')
(2, 'Ricardo', 20, 'Administração')
(3, 'Larissa', 27, 'Engenharia')
(4, 'Letícia', 39, 'Engenharia')
(5, 'Pedro', 28, 'Ciências Biológicas')
(6, 'Leonardo', 30, 'Odontologia')
(7, 'Andréia', 21, 'Engenharia')
(8, 'João', 45, 'Análise e Desenvolvimento de Sistemas')
(9, 'Fabrício', 27, 'Ciência da Computação')
(10, 'Matheus', 32, 'Engenharia')

b) Remova um aluno pelo seu ID.

In [12]:
cursor.execute('DELETE FROM alunos WHERE nome="Fabrício"')
aluno_deletado=cursor.execute('SELECT * FROM alunos')
for deletado in aluno_deletado:
  print(deletado)

(1, 'Mônica', 35, 'Ciências Biológicas')
(2, 'Ricardo', 20, 'Administração')
(3, 'Larissa', 27, 'Engenharia')
(4, 'Letícia', 39, 'Engenharia')
(5, 'Pedro', 28, 'Ciências Biológicas')
(6, 'Leonardo', 30, 'Odontologia')
(7, 'Andréia', 21, 'Engenharia')
(8, 'João', 45, 'Análise e Desenvolvimento de Sistemas')
(10, 'Matheus', 32, 'Engenharia')

5. Criar uma Tabela e Inserir Dados

Crie uma tabela chamada "clientes" com os campos: id (chave
primária), nome (texto), idade (inteiro) e saldo (float).

Insira algunsregistros de clientes na tabela.

In [13]:
cursor.execute('CREATE TABLE IF NOT EXISTS clientes(id INT NOT NULL, nome VARCHAR(100), idade INT, saldo FLOAT, PRIMARY KEY(id))')

In [14]:
# inserindo registros na tabela criada
cursor.execute('''INSERT INTO clientes(id,nome,idade,saldo) VALUES
(1,"Francisco Silva", 47 , 1987.25),
(2,"Maria Eduarda Ferreira",32 , 5200.27),
(3,"Leonardo Gomes",49,150000.00),
(4,"Fernando Silva",75,357000.68),
(5,"Gisele Alemida",50,208654.33),
(6,"Oswaldo Guedes",25,327419.64),
(8,"Isabela Ferreira de Andrade",65,25239.16),
(9,"Fernanda Gonçalves",32,747232.87),
(10,"Milton Oliveira",81,2346635.17)''')

In [15]:
# visualizando a tabela
tabela_clientes=cursor.execute('SELECT * FROM clientes')
for cliente_1 in tabela_clientes:
  print(cliente_1)

(1, 'Francisco Silva', 47, 1987.25)
(2, 'Maria Eduarda Ferreira', 32, 5200.27)
(3, 'Leonardo Gomes', 49, 150000.0)
(4, 'Fernando Silva', 75, 357000.68)
(5, 'Gisele Alemida', 50, 208654.33)
(6, 'Oswaldo Guedes', 25, 327419.64)
(8, 'Isabela Ferreira de Andrade', 65, 25239.16)
(9, 'Fernanda Gonçalves', 32, 747232.87)
(10, 'Milton Oliveira', 81, 2346635.17)

6. Consultas e Funções Agregadas

Escreva consultas SQL para realizar as seguintes tarefas:

a) Selecione o nome e a idade dos clientes com idade superior a
30 anos.

In [16]:
cliente_idade=cursor.execute('SELECT nome,idade FROM clientes WHERE idade>30 ')
for nome in cliente_idade:
  print(nome)

('Francisco Silva', 47)
('Maria Eduarda Ferreira', 32)
('Leonardo Gomes', 49)
('Fernando Silva', 75)
('Gisele Alemida', 50)
('Isabela Ferreira de Andrade', 65)
('Fernanda Gonçalves', 32)
('Milton Oliveira', 81)

b) Calcule o saldo médio dos clientes.

In [17]:
media_valores=cursor.execute('SELECT AVG(saldo) FROM clientes')
for media_saldo in media_valores:
  print(media_saldo[0])

463263.2633333333

c) Encontre o cliente com o saldo máximo

In [18]:
cursor.execute('SELECT nome,saldo FROM clientes WHERE saldo= (SELECT MAX(saldo) FROM clientes)')
saldo_maior = cursor.fetchall()
for saldo_maximo in saldo_maior:
    print(f'Nome: {saldo_maximo[0]}, Saldo: {saldo_maximo[1]}')
# for saldo_maximo in saldo_maior:
  # print(saldo_maior[0])

Nome: Milton Oliveira, Saldo: 2346635.17

d) Conte quantos clientes têm saldo acima de 1000.

In [19]:
maior_de_mil=cursor.execute('SELECT COUNT(id) FROM clientes WHERE saldo>1000')
for contagem in maior_de_mil:
  print(contagem[0])

9

7. Atualização e Remoção com Condições

a) Atualize o saldo de um cliente específico.

In [20]:
cursor.execute('UPDATE clientes SET saldo=370000 WHERE id=10')
saldo_novo=cursor.execute('SELECT * FROM clientes')
for cliente in saldo_novo:
  print(cliente)

(1, 'Francisco Silva', 47, 1987.25)
(2, 'Maria Eduarda Ferreira', 32, 5200.27)
(3, 'Leonardo Gomes', 49, 150000.0)
(4, 'Fernando Silva', 75, 357000.68)
(5, 'Gisele Alemida', 50, 208654.33)
(6, 'Oswaldo Guedes', 25, 327419.64)
(8, 'Isabela Ferreira de Andrade', 65, 25239.16)
(9, 'Fernanda Gonçalves', 32, 747232.87)
(10, 'Milton Oliveira', 81, 370000.0)

b) Remova um cliente pelo seu ID.

In [21]:
remove_cliente=cursor.execute('DELETE FROM clientes WHERE id=5')
deleta_cliente=cursor.execute('SELECT * FROM clientes')
for removido in deleta_cliente:
  print(removido)

(1, 'Francisco Silva', 47, 1987.25)
(2, 'Maria Eduarda Ferreira', 32, 5200.27)
(3, 'Leonardo Gomes', 49, 150000.0)
(4, 'Fernando Silva', 75, 357000.68)
(6, 'Oswaldo Guedes', 25, 327419.64)
(8, 'Isabela Ferreira de Andrade', 65, 25239.16)
(9, 'Fernanda Gonçalves', 32, 747232.87)
(10, 'Milton Oliveira', 81, 370000.0)

8. Junção de Tabelas

Crie uma segunda tabela chamada "compras" com os campos: id
(chave primária), cliente_id (chave estrangeira referenciando o id
da tabela "clientes"), produto (texto) e valor (real).

Insira algumas compras associadas a clientes existentes na tabela "clientes".

Escreva uma consulta para exibir o nome do cliente, o produto e o
valor de cada compra.

In [ ]:
# criando tabela
cursor.execute('CREATE TABLE IF NOT EXISTS compras(id INT PRIMARY KEY, cliente_id INT, produto VARCHAR(100), valor REAL,FOREIGN KEY (cliente_id) REFERENCES clientes (id) )')

In [ ]:
# inserindo registros associados à clientes da tabela CLIENTES
cursor.execute('''INSERT INTO compras(id,cliente_id,produto,valor) VALUES
(2001,1,"Banana",17.50),
(2005,2,"Uva",25.00),
(2006,3,"Ovos",13.00),
(2007,1,"Leite condensado",11.00),
(2008,4,"Milho de pipoca",9.00),
(2011,6,"Abóboras",7.50),
(2012,9,"Massa para lasanha",12.50),
(2015,10,"Feijão preto",9.25),
(2016,10,"Couve Manteiga",7.00),
(2020,10,"Farofa pronta",13.70)
''')

In [ ]:
# visualizando a tabela
compras_tab=cursor.execute('SELECT * FROM compras')
for item_comprado in compras_tab:
  print(item_comprado)

(2001, 1, 'Banana', 17.5)
(2005, 2, 'Uva', 25.0)
(2006, 3, 'Ovos', 13.0)
(2007, 1, 'Leite condensado', 11.0)
(2008, 4, 'Milho de pipoca', 9.0)
(2011, 6, 'Abóboras', 7.5)
(2012, 9, 'Massa para lasanha', 12.5)
(2015, 10, 'Feijão preto', 9.25)
(2016, 10, 'Couve Manteiga', 7.0)
(2020, 10, 'Farofa pronta', 13.7)

In [ ]:
# exibindo o ID da compra, nome do cliente, produto comprado e valor da compra.
cliente_compra=cursor.execute('SELECT co.id,c.nome, co.produto, co.valor FROM compras co JOIN clientes c ON co.cliente_id = c.id;')
for compra_realizada in cliente_compra:
  print(compra_realizada)

(2001, 'Francisco Silva', 'Banana', 17.5)
(2005, 'Maria Eduarda Ferreira', 'Uva', 25.0)
(2006, 'Leonardo Dicaprio', 'Ovos', 13.0)
(2007, 'Francisco Silva', 'Leite condensado', 11.0)
(2008, 'Ozzy Osbourne', 'Milho de pipoca', 9.0)
(2011, 'Harry Potter', 'Abóboras', 7.5)
(2012, 'Fernanda Montenegro', 'Massa para lasanha', 12.5)
(2015, 'Milton Nascimento', 'Feijão preto', 9.25)
(2016, 'Milton Nascimento', 'Couve Manteiga', 7.0)
(2020, 'Milton Nascimento', 'Farofa pronta', 13.7)

In [22]:
conn.commit()

In [23]:
conn.close()